In [1]:
people = {
    'first': ['Thomas', 'Bradyn', 'Kierra'], 
    'last': ['Crane', 'Kramer', 'Gentry'], 
    'email': ['Crane@gmail.com', 'BradynKramer@email.com', 'KierraGentry@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first    last                   email
0  Thomas   Crane         Crane@gmail.com
1  Bradyn  Kramer  BradynKramer@email.com
2  Kierra  Gentry  KierraGentry@email.com

In [5]:
# to add columns to df
# lets combine first and last names and add to df as full_name

df['first'] + ' ' + df['last']

0     Thomas Crane
1    Bradyn Kramer
2    Kierra Gentry
dtype: object

In [6]:
df

    first    last                   email
0  Thomas   Crane         Crane@gmail.com
1  Bradyn  Kramer  BradynKramer@email.com
2  Kierra  Gentry  KierraGentry@email.com

In [7]:
# so to make the changes to the df

df['full_name'] = df['first'] + ' ' + df['last']

In [8]:
df

    first    last                   email      full_name
0  Thomas   Crane         Crane@gmail.com   Thomas Crane
1  Bradyn  Kramer  BradynKramer@email.com  Bradyn Kramer
2  Kierra  Gentry  KierraGentry@email.com  Kierra Gentry

In [21]:
# to remove the columns we want
# use drop() method on the df

df.drop(columns=['first', 'last'])

                    email      full_name
0         Crane@gmail.com   Thomas Crane
1  BradynKramer@email.com  Bradyn Kramer
2  KierraGentry@email.com  Kierra Gentry

In [22]:
df

                    email      full_name   first    last
0         Crane@gmail.com   Thomas Crane  Thomas   Crane
1  BradynKramer@email.com  Bradyn Kramer  Bradyn  Kramer
2  KierraGentry@email.com  Kierra Gentry  Kierra  Gentry

In [16]:
# to split up full_name column to two columns as first and last names

df['full_name'].str.split()

0     [Thomas, Crane]
1    [Bradyn, Kramer]
2    [Kierra, Gentry]
Name: full_name, dtype: object

In [18]:
# to make those items in the list a column we can use expand argument

df['full_name'].str.split(' ', expand=True)

        0       1
0  Thomas   Crane
1  Bradyn  Kramer
2  Kierra  Gentry

In [19]:
# now lets name the column and add it to the df

df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [20]:
df

                    email      full_name   first    last
0         Crane@gmail.com   Thomas Crane  Thomas   Crane
1  BradynKramer@email.com  Bradyn Kramer  Bradyn  Kramer
2  KierraGentry@email.com  Kierra Gentry  Kierra  Gentry

In [24]:
# to add a row to df

df.append({'first':'Tomy'}, ignore_index=True)  # added but other valuse are NaN

                    email      full_name   first    last
0         Crane@gmail.com   Thomas Crane  Thomas   Crane
1  BradynKramer@email.com  Bradyn Kramer  Bradyn  Kramer
2  KierraGentry@email.com  Kierra Gentry  Kierra  Gentry
3                     NaN            NaN    Tomy     NaN

In [25]:
# to add data frames on a dataframes
# lets create another dataframe from this dictionary

people = {
    'first': ['Corey', 'Jane', 'John'], 
    'last': ['Schafer', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

# create df
df2 = pd.DataFrame(people)

In [26]:
df2

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [27]:
df

                    email      full_name   first    last
0         Crane@gmail.com   Thomas Crane  Thomas   Crane
1  BradynKramer@email.com  Bradyn Kramer  Bradyn  Kramer
2  KierraGentry@email.com  Kierra Gentry  Kierra  Gentry

In [29]:
# to add df2 to df

df.append(df2, ignore_index=True)

                     email      full_name   first     last
0          Crane@gmail.com   Thomas Crane  Thomas    Crane
1   BradynKramer@email.com  Bradyn Kramer  Bradyn   Kramer
2   KierraGentry@email.com  Kierra Gentry  Kierra   Gentry
3  CoreyMSchafer@gmail.com            NaN   Corey  Schafer
4        JaneDoe@email.com            NaN    Jane      Doe
5        JohnDoe@email.com            NaN    John      Doe

In [30]:
df

                    email      full_name   first    last
0         Crane@gmail.com   Thomas Crane  Thomas   Crane
1  BradynKramer@email.com  Bradyn Kramer  Bradyn  Kramer
2  KierraGentry@email.com  Kierra Gentry  Kierra  Gentry

In [31]:
# to make change to the new df

df = df.append(df2, ignore_index=True)

In [32]:
df

                     email      full_name   first     last
0          Crane@gmail.com   Thomas Crane  Thomas    Crane
1   BradynKramer@email.com  Bradyn Kramer  Bradyn   Kramer
2   KierraGentry@email.com  Kierra Gentry  Kierra   Gentry
3  CoreyMSchafer@gmail.com            NaN   Corey  Schafer
4        JaneDoe@email.com            NaN    Jane      Doe
5        JohnDoe@email.com            NaN    John      Doe

In [49]:
# to remove a row by its index
# df.drop(2, inplace=True)

df.drop(3, inplace=True)

In [45]:
# to remove a row or rows on specific character

filt = (df['last'] == 'Doe')
df.drop(index=df[filt].index, inplace=True)

In [38]:
df

                     email      full_name   first     last
0          Crane@gmail.com   Thomas Crane  Thomas    Crane
1   BradynKramer@email.com  Bradyn Kramer  Bradyn   Kramer
2   KierraGentry@email.com  Kierra Gentry  Kierra   Gentry
3  CoreyMSchafer@gmail.com            NaN   Corey  Schafer

In [50]:
df

                    email      full_name   first    last
0         Crane@gmail.com   Thomas Crane  Thomas   Crane
1  BradynKramer@email.com  Bradyn Kramer  Bradyn  Kramer